loadtest/tests/packageService/packageservice.loadtest.yml
config:
  target: "http://localhost:9001"
  processor: "./customFunctions.js"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 30 # warmup phase (establishing connection, lazy loading, optimizations etc.)
      arrivalRate: 10
      rampTo: 50
      name: "Warmup"
    - duration: 30
      arrivalRate: 500

scenarios:
  - name: Register Package
    weight: 2
    flow:
      - post:
          url: "/packages"
          json:
            receiverAddress: "Random Adresse Odense S 5260"
            receiverName: "Oliver Marco van Komen"
            receiverEmail: "randomEmail@gmail.com"
            senderAddress: "Bergvägen 1, SE-341 42 LJUNGBY, SWEDEN"
            senderName: "Komplett.dk"
            weightKg: 12
            fakeScenario: true
          afterResponse: "savePackageID"
  - name: Transport Company Delivery
    weight: 2
    flow:
      - function: "getPackageID"
      - post:
          url: "/packages/central"
          json:
            packageIDs: [
              "{{ packageID }}"
            ]
            fakeScenario: true
  - name: DriverDelivery Start
    weight: 2
    flow:
      - function: "emulateDriverID"
      - function: "getPackageID"
      - post:
          url: "/packages/inroute"
          json:
            packageIDs: ["{{ packageID }}"]
            driverID: "{{ driverID }}"
            fakeScenario: true
  - name: Get packageDetails
    weight: 1
    flow:
      - function: "getPackageID"
      - get:
          url: "/packages?packageID={{ packageID }}"